GigaMatt/jaws-the-game-msp430/project/shapemotion.c
/** \file shapemotion.c
 *  \brief This is a simple shape motion demo.
 *  This demo creates two layers containing shapes.
 *  One layer contains a rectangle and the other a circle.
 *  While the CPU is running the green LED is on, and
 *  when the screen does not need to be redrawn the CPU
 *  is turned off along with the green LED.
 */  
#include <msp430.h>
#include <libTimer.h>
#include <lcdutils.h>
#include <lcddraw.h>
#include <p2switches.h>
#include <shape.h>
#include <abCircle.h>
#include "buzzer.h"

#define GREEN_LED BIT6

int abSlicedRectCheck(const AbRect *rect, const Vec2 *centerPos, const Vec2 *pixel){
  Vec2 relPos;
  vec2Sub(&relPos, pixel, centerPos);
  if(relPos.axes[1] <= 4 && relPos.axes[1]/2 < relPos.axes[2])
    return 0;
  else
    return abRectCheck (rect,centerPos,pixel);
  
}
int abSlicedArrowCheck(const AbRArrow *shape, const Vec2 *centerPos, const Vec2 *pixel){
  Vec2 relPos;
  vec2Sub(&relPos, pixel, centerPos);
  if(relPos.axes[1]>=-6 && relPos.axes[0]/2 < relPos.axes[1])
    return 0;
  else
    return abRArrowCheck(shape, centerPos, pixel);
}

AbRect rect10 = {abRectGetBounds, abSlicedRectCheck, {10,10}}; /**< 10x10 rectangle */
AbRArrow rightArrow = {abRArrowGetBounds, abSlicedArrowCheck, 30};

AbRectOutline fieldOutline = {	/* playing field */
  abRectOutlineGetBounds, abRectOutlineCheck,   
  {screenWidth/2 - 10, screenHeight/2 - 15}
};

Layer layer4 = {
  (AbShape *)&rightArrow,
  {(screenWidth/2)+5, (screenHeight/2)+5}, /**< bit below & right of center */
  {0,0}, {0,0},				    /* last & next pos */
  COLOR_YELLOW,
  0, 
};
  

Layer layer3 = {		/**< Layer with an orange circle */
  (AbShape *)&rightArrow,
  {(screenWidth/2)+10, (screenHeight/2)+61}, /**< bit below & right of center */
  {0,0}, {0,0},				    /* last & next pos */
  COLOR_WHITE,
  &layer4,
};


Layer fieldLayer = {		/* playing field as a layer */
  (AbShape *) &fieldOutline,
  {screenWidth/2, (screenHeight/2)},/**< center */
  {0,0}, {0,0},				    /* last & next pos */
  COLOR_BROWN,
  &layer3
};

Layer layer1 = {		/**< Layer with a red square */
  (AbShape *)&rect10,
  {screenWidth/2+40, screenHeight/2+51}, /**< center */
  {0,0}, {0,0},				    /* last & next pos */
  COLOR_BROWN,
  &fieldLayer,
};

Layer layer0 = {		/**< Layer with an orange circle */
  (AbShape *)&circle14,
  {(screenWidth/2)+10, (screenHeight/2)+7}, /**< bit below & right of center */
  {0,0}, {0,0},				    /* last & next pos */
  COLOR_YELLOW,
  &layer1,
};

/** Moving Layer
 *  Linked list of layer references
 *  Velocity represents one iteration of change (direction & magnitude)
 */
typedef struct MovLayer_s {
  Layer *layer;
  Vec2 velocity;
  struct MovLayer_s *next;
} MovLayer;

/* initial value of {0,0} will be overwritten */
MovLayer ml3 = { &layer3, {1,0}, 0 }; /**< not all layers move */
MovLayer ml1 = { &layer1, {0,0}, &ml3 }; 
MovLayer ml0 = { &layer0, {0,0}, &ml1 }; 
//MovLayer ml4 = { &layer4, {2,1}, &ml0 }; 

void movLayerDraw(MovLayer *movLayers, Layer *layers)
{
  int row, col;
  MovLayer *movLayer;

  and_sr(~8);			/**< disable interrupts (GIE off) */
  for (movLayer = movLayers; movLayer; movLayer = movLayer->next) { /* for each moving layer */
    Layer *l = movLayer->layer;
    l->posLast = l->pos;
    l->pos = l->posNext;
  }
  or_sr(8);			/**< disable interrupts (GIE on) */


  for (movLayer = movLayers; movLayer; movLayer = movLayer->next) { /* for each moving layer */
    Region bounds;
    layerGetBounds(movLayer->layer, &bounds);
    lcd_setArea(bounds.topLeft.axes[0], bounds.topLeft.axes[1], 
		bounds.botRight.axes[0], bounds.botRight.axes[1]);
    for (row = bounds.topLeft.axes[1]; row <= bounds.botRight.axes[1]; row++) {
      for (col = bounds.topLeft.axes[0]; col <= bounds.botRight.axes[0]; col++) {
	Vec2 pixelPos = {col, row};
	u_int color = bgColor;
	Layer *probeLayer;
	for (probeLayer = layers; probeLayer; 
	     probeLayer = probeLayer->next) { /* probe all layers, in order */
	  if (abShapeCheck(probeLayer->abShape, &probeLayer->pos, &pixelPos)) {
	    color = probeLayer->color;
	    break; 
	  } /* if probe check */
	} // for checking all layers at col, row
	lcd_writeColor(color); 
      } // for col
    } // for row
  } // for moving layer being updated
}	  



//Region fence = {{10,30}, {SHORT_EDGE_PIXELS-10, LONG_EDGE_PIXELS-10}}; /**< Create a fence region */

/** Advances a moving shape within a fence
 *  
 *  \param ml The moving shape to be advanced
 *  \param fence The region which will serve as a boundary for ml
 */
void mlAdvance(MovLayer *ml, Region *fence)
{
  Vec2 newPos;
  u_char axis;
  Region shapeBoundary;
  int velocity;
  for (; ml; ml = ml->next) {
    vec2Add(&newPos, &ml->layer->posNext, &ml->velocity);
    abShapeGetBounds(ml->layer->abShape, &newPos, &shapeBoundary);
    for (axis = 0; axis < 2; axis ++) {
      if ((shapeBoundary.topLeft.axes[axis] < fence->topLeft.axes[axis]) ||
	  (shapeBoundary.botRight.axes[axis] > fence->botRight.axes[axis]) ) {
	velocity = ml->velocity.axes[axis] = -ml->velocity.axes[axis];
	if(velocity<0){
	  drawString5x7(20, 35, "NOM NOM NOM NOM ", COLOR_RED,COLOR_BLUE);
	  buzzer_set_period(1000);
	  newPos.axes[axis] += (2*velocity);
	  // velocity = 0;
	  //drawString5x7(20, 35, "                ", COLOR_RED,COLOR_BLUE);
	}
	if(velocity > 0){
	   drawString5x7(20, 35, "OH NO SHARK    ", COLOR_RED,COLOR_BLUE);
	  
	}
	//	if(velocity == 0 ){
	//drawString5x7(35, 35, " " , COLOR_RED, COLOR_BLUE);
	//}
	//	newPos.axes[axis] += (2*velocity);
      }	/**< if outside of fence */
    } /**< for axis */
    ml->layer->posNext = newPos;
    
  } /**< for ml */
}


u_int bgColor = COLOR_BLUE;     /**< The background color */
int redrawScreen = 1;           /**< Boolean for whether screen needs to be redrawn */

Region fieldFence;		/**< fence around playing field  */


/** Initializes everything, enables interrupts and green LED, 
 *  and handles the rendering for the screen
 */
void main()
{
  P1DIR |= GREEN_LED;		/**< Green led on when CPU on */		
  P1OUT |= GREEN_LED;

  configureClocks();
  lcd_init();
  shapeInit();
  p2sw_init(1);

  shapeInit();

  layerInit(&layer1);
  layerDraw(&layer1);

  buzzer_init();

  layerGetBounds(&fieldLayer, &fieldFence);


  enableWDTInterrupts();      /**< enable periodic interrupt */
  or_sr(0x8);	              /**< GIE (enable interrupts) */

 drawString5x7(41,6,"Shark Game", COLOR_WHITE, COLOR_BLUE);
  for(;;) { 
    while (!redrawScreen) { /**< Pause CPU if screen doesn't need updating */
      P1OUT &= ~GREEN_LED;    /**< Green led off witHo CPU */
      or_sr(0x10);	      /**< CPU OFF */
    }
    P1OUT |= GREEN_LED;       /**< Green led on when CPU on */
    redrawScreen = 0;
    movLayerDraw(&ml0, &layer0);
  }
}

/** Watchdog timer interrupt handler. 15 interrupts/sec */
void decisecond(){
  static char cnt = 0;
  if(++cnt > 2) {
    buzzer_advance_frequency();
    cnt = 0;
  }
}

void wdt_c_handler()
{
  static char second_count = 0, decisecond_count = 0;
  if(++ decisecond_count == 25){
    buzzer_advance_frequency();
    decisecond_count = 0;
  }

  static short count = 0;
  P1OUT |= GREEN_LED;		      /**< Green LED on when cpu on */
  count ++;
  if (count == 15) {
    mlAdvance(&ml1, &fieldFence);
    // mlAdvance(&  
    if (p2sw_read())
      redrawScreen = 1;
    count = 0;
  }
  
  P1OUT &= ~GREEN_LED;		    /**< Green LED off when cpu off */
}
